export const chartOptions = {
  xAxis: {
    type: 'category',
    data: ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30']
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      data: [820, 932, 901, 934, 1290, 1330, 1320],
      type: 'line',
      smooth: true
    }
  ]
}

export const aboutText = [
  '斯特鲁普效应在心理学中指优势反应对非优势反应的干扰。',
  '例如当测试者被要求回答有颜色意义的字体的颜色时，回答字本身的意义为优势反应，而回答字体颜色为非优势反应。',
  '若字体颜色与字意不同，被测者往往会反应速度下降，出错率上升。',
  '在该测试中，你需要根据展示的文本回答是否是对应颜色，您有30秒的时间，尽可能多回答！',
  '如果您答错了，则游戏结束。'
]

export const colorArr = [
  {
    color: '#FF0000',
    name: '红色'
  },
  {
    color: '#00FF00',
    name: '绿色'
  },
  {
    color: '#0000FF',
    name: '蓝色'
  },
  {
    color: '#FFFF00',
    name: '黄色'
  },
  {
    color: '#C0C0C0',
    name: '灰色'
  }
]