export const chartOptions = {
  xAxis: {
    type: 'category',
    data: ['4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30']
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      data: [820, 932, 901, 934, 1290, 1330, 1320],
      type: 'line',
      smooth: true
    }
  ]
}

export const aboutText = [
  '这是对每分钟打字速度的简单测试。',
  '在这项研究中，有些黑猩猩能够在90%的时间内记住9位数。',
  '这个测试是黑猩猩测试的一个变体，测试从4位数开始，如果您通过一个级别，则数字会增加。如果您在同一级别连续三次失败，则游戏结束。'
]

export const gameData = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,]
