export const chartOptions = {
  xAxis: {
    type: 'category',
    data: ['4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30']
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      data: [820, 932, 901, 934, 1290, 1330, 1320],
      type: 'line',
      smooth: true
    }
  ]
}

export const aboutText = [
  '这是一项关于记忆的测试，因一项研究而闻名，该研究发现黑猩猩在这项任务上的表现始终优于人类。',
  '在这项研究中，黑猩猩的表现一直优于人类，一些黑猩猩能够在 90% 以上的时间内记住 9 个数字。',
  '这个测试是这个概念的一个变体，每回合都会变得越来越难，从4位数开始，每回合增加一个。如果您通过一个级别，则数字会增加。如果你失败了，你会得到一个罢工。三击结束，测试结束。'
]

export const gameData = [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,]
